{
  "graduations": [
    {
      "year": "July 2017 - August 2019",
      "type": "BACHELOR DEGREE",
      "school": "COVENTRY UNIVERSITY, Singapore",
      "info": "Bachelor Of Science in Computer Science, Graduated with Upper Second Class Division"
    },
    {
      "year": "April 2016 - April 2017",
      "type": "Diploma",
      "school": "PSB Academy, Singapore",
      "info": "Diploma in Infocomm &amp; Technology, Pass with merit"
    }
  ],
  "works": [
    {
      "year": "Oct 2023 - Now",
      "type": "Senior Frontend Dev",
      "school": "Oppstar Technology Sdn.Bhd, Malaysia",
      "info": "Spearheaded the development of a new product from inception, collaborating closely with upper management to create innovative UI designs and functionalities. Conducted extensive research to inform decision-making and drive the implementation of essential new features. Utilized Solid.js and TypeScript to build robust and efficient solutions, ensuring high performance and scalability. Mentored and coached junior developers within the team, fostering a culture of continuous learning and improvement.Played a pivotal role in establishing coding best practices and promoting a flexible mindset in code structuring. Demonstrated leadership within the team, guiding project development with expertise and adaptability."
    },
    {
      "year": "Jan 2023 - Sept 2023",
      "type": "Frontend Dev, Digital Dev Ops",
      "school": "Maybank, Malaysia",
      "info": "I prioritize maintaining its excellent condition, satisfying user and business requirements, and creating a dynamic and easily updatable website. I work with the Scrum method and thrive in the fast-paced environment, constantly learning new skills. Additionally, I contribute to production migration, conduct code reviews, and fix bugs during monthly releases of the M2U website."
    },
    {
      "year": "June 2022 - July 2022",
      "type": "Front End Developer(Contract Staff)",
      "school": "My AOne Learning Sdn. Bhd, Malaysia",
      "info": "Responsible for the conversion of a design element into a working website, Accurately translate user and business needs into functional frontend code & develop and maintain web-based frontend application in Javascript/VueJS"
    },
    {
      "year": "June 2021 - June 2022",
      "type": "Web Developer",
      "school": "Unicom Interactive Digital, Malaysia",
      "info": "In charge of the frontend projects, assigned to create multiple responsive websites based on the design given from scratch to functional websites. Use Laravel framework as based and HTML, CSS, Bootstrap for frontend."
    },
    {
      "year": "November 2020 - June 2021",
      "type": "Junior Web Developer",
      "school": "Coreka Co, Malaysia",
      "info": "Responsible for creating the front end of several real life website. The website is built in opencart platform which is PHP based. I also have the responsibility of doing the backend of the project including using ajax,jquery validation and getting/saving data into phpmyadmin sql."
    },
    {
      "year": "November 2019 - June 2021",
      "type": "Apprentice Web Developer",
      "school": "Phisoft, Malaysia",
      "info": "Have a hands on creating a website with microweber platform and uses bootstrap 4."
    }
  ]
}